Tekla Open API Reference for Tekla Structures 2025
Assembly.SetMainObject Method
 Sets the main object of the assembly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetMainObject(
	ModelObject mainObject
)
Public Function SetMainObject (
	mainObject As ModelObject
) As Boolean
Parameters
mainObject
Type: Tekla.Structures.Model.ModelObject
The Part, Reinforcement, or RebarSet object to set as the main object of the assembly.
Return Value
Type: Boolean
True if the object is valid; otherwise false.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace